Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::TransitionUIManager Class Referencefinal
MEP Element Manager
The TransitionUIManager contains UI-related services for a Transition. More...
#include <MEPTransitionUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::v1::TransitionUIManager:
 Public Member Functions
Result< TransitionDefault >  | CreateTransitionDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a TransitionDefault from a toolUIData.
Result< void >  | ApplyTransitionDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const TransitionDefault &transitionDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< TransitionUIManager >  | CreateTransitionUIManager ()
Creates a TransitionUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The TransitionUIManager contains UI-related services for a Transition.
Since
Archicad 28
Member Function Documentation
◆ ApplyTransitionDefaultToToolUIData()
 Result< void > ACAPI::MEP::v1::TransitionUIManager::ApplyTransitionDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData &  |  toolUIData,
|  const TransitionDefault &  |  transitionDefault
)
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
transitionDefault | The default to be set
Returns
Returns error if the TransitionDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateTransitionDefaultFromToolUIData()
 Result< TransitionDefault > ACAPI::MEP::v1::TransitionUIManager::CreateTransitionDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData &  |  toolUIData | )
Creates a TransitionDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Transition in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an TransitionDefault, otherwise returns the TransitionDefault created from it.
Friends And Related Symbol Documentation
◆ CreateTransitionUIManager
 Result< TransitionUIManager > CreateTransitionUIManager  |  ( |   | )
friend
Creates a TransitionUIManager.
Returns
If able, creates a new manager for Transitions, otherwise Error.